/* Errors returned by the device in the form of xml */
"Success" = "Operazione riuscita";
"TestInProgress" = "Test in corso... Attendere.";
"ErrorDeviceBusy" = "Il dispositivo è occupato. Riprovare più tardi.";
"ErrorDuplicateDisplayName" = "Nome ubicazione o visualizzazione duplicato. Assegnare un altro nome e riprovare.";
"ErrorEmptyEntry" = "Una delle voci nelle impostazioni inviate al dispositivo è vuota. Verificare che tutte le voci siano valide e riprovare.";
"ErrorListFull" = "Spazio disponibile insufficiente per aggiungere questa voce. Eliminare una voce dal dispositivo e riprovare.";
"ErrorSettingNotTested" = "Impostazione non verificata.";
"ErrorSystemFailure" = "Errore critico. Riprovare più tardi.";
"ErrorNoMoreSpace" = "La dimensione massima per gli allegati ai messaggi e-mail è troppo grande per il server selezionato. Immettere un valore minore e riprovare.";
"ErrorNoWritePermission" = "La cartella selezionata non dispone dell'autorizzazione di scrittura. Impostare i diritti di accesso appropriati per la cartella e riprovare.";
"ErrorConnectionFailed" = "Impossibile connettere il dispositivo al server remoto specificato. Verificare le impostazioni del server.";
"ErrorConnectionRefused" = "Il server ha rifiutato la connessione. Verificare che il server sia acceso e funzioni correttamente.";
"ErrorServerNotFound" = "Impossibile risolvere il nome host del server. Verificare le impostazioni del server.";
"ErrorWrongCredentials" = "Il server ha rifiutato le credenziali utente utilizzate per l'autenticazione. Immettere le credenziali corrette e riprovare.";
"ErrorConnectionProblem" = "Problema durante la connessione al server remoto. Verificare che il server sia connesso alla rete e funzioni correttamente.";
"ErrorProtocolNotSupported" = "Il server remoto utilizza un protocollo non supportato.";
"ErrorInvalidFileOrDirectory" = "Il percorso specificato non è valido. Specificare un percorso valido e riprovare.";
"ErrorInvalidFolderPath" = "Il percorso specificato non è valido. Specificare un percorso valido e riprovare.";
"ErrorInvalidShare" = "La cartella condivisa non è valida. Selezionare un'altra cartella condivisa e riprovare.";
"ErrorAuthenticationNeeded" = "Per il server specificato è necessaria l'autenticazione. Immettere le credenziali corrette per accedere al server e riprovare.";
"ErrorSecureConnectionNotSupported" = "Il server non supporta le connessioni protette. Deselezionare la casella Usa SSL e riprovare.";
"ErrorSenderInvalid" = "L'indirizzo e-mail del mittente non è valido. Immettere un indirizzo valido per il mittente e riprovare.";
"ErrorRecipientInvalid" = "L'indirizzo e-mail del destinatario non è valido. Immettere un indirizzo valido per il destinatario e riprovare.";
"ErrorServerError" = "Il server ha restituito un errore. Impossibile completare l'operazione richiesta. Verificare se i dettagli immessi per il server sono corretti.";
"ErrorInvalidServerName" = "Il server specificato non è valido. Immettere un server SMTP valido e riprovare.";

"404 Not Found" = "Impossibile trovare il dispositivo. Verificare che il dispositivo sia connesso alla rete e acceso.";
"400 Bad Request" = "Impossibile elaborare la richiesta a causa di un errore nella richiesta. Riprovare più tardi.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "Il dispositivo non ha restituito un URL valido. Attendere qualche minuto e riprovare.";

/* XML Data validation errors */
"Setting Error" = "Errore per dati mancanti o non validi";
"MISSING_FOLDER_SETTING" = "Mancano alcuni dettagli delle cartelle. Selezionare una cartella, immettere nome utente e password e riprovare.";
"MISSING_EMAIL_SETTING" = "Mancano alcuni dettagli per le destinazioni delle e-mail. Immettere tutte le impostazioni per le e-mail e riprovare.";
"MISSING_SERVER_CREDENTIALS" = "Mancano le credenziali del server. Immettere nome utente e password e riprovare.";
"MISSING_DISPLAY_NAME" = "Manca il nome del mittente. Immettere il nome del mittente e riprovare.";
"MISSING_EMAIL_ADDRESS" = "Manca l'indirizzo e-mail. Immettere un indirizzo e-mail valido e riprovare.";
"MISSING_SERVER" = "Manca il server. Specificare un server e riprovare.";

"INVALID_PIN" = "Il PIN immesso non è valido. Il numero deve essere composto da 4 cifre. Immettere un PIN valido e riprovare.";
"INVALID_SERVER_PORT" = "Il numero della porta del server immesso non è valido. Il numero della porta deve essere compreso tra 1 e 65535.";
"INVALID_ATTMT_SIZE" = "La dimensione massima immessa per gli allegati non è valida. Il numero deve essere compreso tra 1 e 9999. Specificare -1 per l'impostazione per la dimensione automatica degli allegati.";
"INVALID_DFADESTINATION" = "La destinazione fax digitale selezionata non è valida. Selezionare una destinazione corretta.";
"INVALID_POLLING_TIME" = "L'intervallo selezionato non è valido. I valori validi sono 5, 10, 15, 20, 30, 45 and 60. Selezionare un intervallo corretto e riprovare.";
"INVALID_DISPLAY_NAME" = "Il nome immesso per il mittente non è valido. Immettere un nome che contenga meno di 25 caratteri.";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Errore";
"GENERIC_DEVICE_ERROR_TITLE" = "Errore dispositivo";
"GENERIC_DEVICE_ERROR_DESC" = "Errore sconosciuto durante la comunicazione con il dispositivo. Riprovare più tardi.";
"XML_PARSING_ERROR" = " Il dispositivo ha restituito dati non validi. Attendere qualche minuto e riprovare.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "Errore durante la comunicazione con il dispositivo. Verificare che il dispositivo e il computer siano connessi alla rete e riprovare.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Annulla";
"Hide" = "Nascondi";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Dispositivo non trovato";
"DEVICE_NOT_FOUND_DESC" = "Problema durante la comunicazione con il dispositivo. Verificare che il dispositivo sia accesso e connesso correttamente e riprovare.";

"PML_ERROR_TITLE" = "Errore dispositivo";
"PML_ERROR_DESC1" = "Problema durante l'impostazione delle informazioni nel dispositivo. Verificare che i valori immessi siano validi.";

"SETTING_REJECTED_TITLE" = "Impostazioni non accettate";

"SETTING_REJECTED_DESCRIPTION" = "Impossibile eseguire la configurazione perché il dispositivo è protetto da una password di amministrazione. Utilizzare Server Web incorporato per rimuovere la password di amministrazione. Consultare la documentazione del dispositivo per maggiori informazioni";
"GENERAL_DATA_MISSING_DESCRIPTION" = "Uno o più campi non contengono dati. Riempire tutti i campi o fare clic su Annulla.";

//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Sportello/coperchio aperto";
"DOOR_OPEN_DESC" = "Impossibile stampare perché uno sportello è aperto. Chiudere tutti gli sportelli della stampante.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Errore stampante";
"INCORRECT_STATE_DESC" = "Risolvere la condizione d'errore della periferica e riprovare.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "La stampante è occupata";
"DEVICE_BUSY_DESC" = "Attendere che la stampante termini il lavoro corrente.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "ID chiamante non supportato";
"CALLER_ID_NOT_SUPPORTED_DESC" = "Il paese/regione correntemente impostato sulla periferica non supporta la funzione per l'ID chiamante. Dal pannello anteriore della periferica selezionare un paese/regione che supporti tale funzione e riprovare.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Impossibile applicare le impostazioni.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Verificare che il dispositivo sia online e non stia elaborando un fax.";

